<?php
    require_once "Scripts/session.php";
?>

<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="Styles/index.css">
    
    <script src="Scripts/navbar_function.js"></script>
    <script src="Scripts/loadmenu.js"></script>

    <link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css">
    
    <title>SuperApp</title>
</head>

<body onload="loadMenu('<?php echo $_userRole?>');">
    <div class="container">
        <header>
            <a href="index.php">
                <img src="Media/transparentlogo.png" alt="logo" class="header_logo">
                <h1>C</h1>
                <p>..a programming language</p>
            </a>
        </header>
        <nav>
            <div class="menu" id="navbar">
            </div>
        </nav>
        <main>
            <div>
                <h2>
                    Basics <?php echo $_userName; ?>
                </h2>
                <img src="Media\imggrey.jpg" alt="imggrey"></img>
                <article class="article">
                    <p>&nbsp;&nbsp;&nbsp;&nbsp;Η C (προφέρεται "σι") είναι μια διαδικαστική γλώσσα προγραμματισμού γενικής χρήσης, η
                        οποία αναπτύχθηκε αρχικά, μεταξύ
                        του 1969 και του 1973, από τον Ντένις Ρίτσι στα εργαστήρια AT&T Bell Labs για να χρησιμοποιηθεί για την ανάπτυξη
                        του
                        λειτουργικού συστήματος UNIX. Όπως οι περισσότερες διαδικαστικές γλώσσες προγραμματισμού που ακολουθούν την
                        παράδοση της
                        ALGOL, η C έχει δυνατότητες δομημένου προγραμματισμού και επιτρέπει τη χρήση αναδρομής (αλλά όχι και
                        εμφωλευμένων
                        συναρτήσεων), ενώ, ο στατικός ορισμός του τύπου των μεταβλητών που επιβάλλει, προλαμβάνει πολλά σφάλματα κατά
                        την χρήση
                        τους. Ο σχεδιασμός της περιλαμβάνει δομές που μεταφράζονται αποδοτικά σε τυπικές εντολές μηχανής (machine
                        instructions)
                        και εξ αιτίας αυτού χρησιμοποιείται συχνά σε εφαρμογές που παλιότερα γράφονταν σε συμβολική γλώσσα (assembly
                        language).
                        Αυτό ακριβώς το χαρακτηριστικό της, που έχει σαν συνέπεια και την αυξημένη ταχύτητα εκτέλεσης των εφαρμογών που
                        γράφονται σε αυτή, καθώς και το γεγονός ότι είναι διαθέσιμη στα περισσότερα σημερινά λειτουργικά συστήματα,
                        συνέβαλε
                        κατά πολύ στην καθιέρωση της και την χρήση της για ανάπτυξη λειτουργικών συστημάτων και λοιπών προγραμμάτων
                        συστήματος
                        (system software), αλλά και απλών εφαρμογών.</p>
                    <p>&nbsp;&nbsp;&nbsp;&nbsp;Η C συγκαταλέγεται πλέον στις πιο ευρέως χρησιμοποιούμενες γλώσσες προγραμματισμού όλων
                        των εποχών και πολλές νεώτερες
                        γλώσσες έχουν επηρεαστεί άμεσα ή έμμεσα από αυτήν, συμπεριλαμβανομένων των C++, C#, D, Go, Java, JavaScript,
                        Limbo, LPC,
                        Perl, PHP, Python, καθώς και του κελύφους C (C shell) του Unix. Κάποιες από αυτές τις γλώσσες έχουν επηρεαστεί
                        κυρίως
                        στη σύνταξη τους, με το σύστημα τύπων, τα μοντέλα δεδομένων και το νόημα των εκφράσεων τους να διαφέρουν
                        σημαντικά από
                        την C. Η C++, ειδικά, ξεκίνησε σαν προεπεξεργαστής της C, αλλά έχει εξελιχθεί πλέον σε μια αντικειμενοστραφή
                        γλώσσα, που
                        αποτελεί υπερσύνολο της C.</p>
                    Source:
                    <a href="https://en.wikipedia.org/wiki/C_(programming_language)" target="_blank" rel="noopener">Wikipedia</a>
                </article>
                <br>
            </div>
        </main>
        <section>
            <div>
                <article class="article">
                    <h3>
                        Τύποι δεδομένων
                    </h3>
                    <img src="Media/imgbookalt.jpg" alt="Η Γλώσσα Προγραμματισμού C" class="img_book">
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;Το σύστημα τύπου της C είναι στατικό και ασθενώς διατυπομένο,
                        γεγονός που το καθιστά παρόμοιο με το σύστημα τύπου των απογόνων ALGOL όπως της Pascal.
                        Υπάρχουν ενσωματωμένοι τύποι για ακέραιους αριθμούς διαφόρων μεγεθών, τόσο signed και unsigned,
                        floating-point numbers και enumerated τύποι. Ο ακέραιος τύπος char χρησιμοποιείται συχνά για χαρακτήρες ενός byte.
                        Με την C99 προστέθηκε ένας δυαδικός τύπος δεδομένων.
                        Υπάρχουν επίσης παράγωγοι τύποι όπως πίνακες, δείκτες, structs και unions.
                    </p>
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;H C χρησιμοποιείται συχνά σε προγραμματισμό συστημάτων χαμηλού επιπέδου όπου ενδέχεται να απαιτούνται διαφυγές από το σύστημα τύπου.
                        Ο μεταγλωττιστής προσπαθεί να διασφαλίσει την ορθότητα του τύπου των περισσότερων εκφράσεων,
                        αλλά ο προγραμματιστής μπορεί να παρακάμψει τους ελέγχους με διάφορους τρόπους,
                        είτε χρησιμοποιώντας έναν τύπο τύπου για να μετατρέψει ρητά μια τιμή από έναν τύπο σε έναν άλλο,
                        είτε χρησιμοποιώντας δείκτες ή unions για να ερμηνεύσει
                        εκ νέου τα υποκείμενα bit ενός αντικειμένου δεδομένων με κάποιον άλλο τρόπο.
                    </p>
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;Ορισμένοι θεωρούν ότι η σύνταξη δήλωσης C δεν είναι διαισθητική, ειδικά για δείκτες συνάρτησης.
                        Οι συνήθεις αριθμητικές μετατροπές της C επιτρέπουν τη δημιουργία αποτελεσματικού κώδικα,
                        αλλά μερικές φορές μπορεί να παράγει απροσδόκητα αποτελέσματα.
                    </p>
                </article>
            </div>
            <div>
                <article class="article" style="clear: both;">
                    <h3>
                        Παράδειγμα "Hello world!"
                    </h3>
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;Το πλέον καθιερωμένο εισαγωγικό πρόγραμμα σε C ενός ανερχόμενου προγραμματιστή όπου
                        εκτυπώνει στο τερματικό την φράση "Hello world!":
                    <pre class="aside_links_list">
#include &lt;stdio.h&gt;
    
int main()
{
    printf("Hello, world\n");
}
                        </pre>
                    </p>
                </article>
            </div>
        </section>
        <aside class="aside_links_list">
            <div>
                <article class="article">
                    <img src="Media/dennis_macalistair_ritchie_.jpeg" alt="Dennis Ritchie" class="img_prof">
                    <p>
                        &nbsp;&nbsp;&nbsp;&nbsp;Ο Ντένις Ρίτσι (9 Σεπτεμβρίου 1941 - 12 Οκτωβρίου 2011) ήταν Αμερικανός επιστήμονας υπολογιστών,
                        αξιοσημείωτος για την επιρροή του σε διάφορες γλώσσες προγραμματισμού, με κυριότερη την C, αλλά και σε λειτουργικά συστήματα,
                        όπως το Unix. Έχει λάβει το βραβείο Τούρινγκ το 1983 και το αμερικανικό Εθνικό Μετάλλιο Τεχνολογίας το 1998.
                        Ο Ρίτσι είναι γνωστός κυρίως ως ο δημιουργός της γλώσσας προγραμματισμού C
                        και ως βασικός συντελεστής στην ανάπτυξη του λειτουργικού συστήματος UNIX.
                        Η ανάπτυξη του μεταγλωττιστή της C βασίστηκε και αυτή με τη σειρά της σε ιδέες και αρχές άλλων γλωσσών, όπως η Pascal.
                        Το δημοφιλές Linux και τα εργαλεία του αποτελούν απογόνους της δουλειάς του Ρίτσι όπως και το πλέον καθοριστικό βιβλίο
                        όπου έχει συγγράψει για τη C(Η Γλώσσα Προγραμματισμού C, που συχνά αναφέρεται και ως Κέρνιχαν-Ρίτσι).
                        Η C χρησιμοποιείται ακόμα και σήμερα στην ανάπτυξη λειτουργικών συστημάτων,
                        γεγονός που οφείλεται στο ότι πολλά εκπαιδευτικά ιδρύματα χρησιμοποιούν Linux, το οποίο βασίζεται στο UNIX.
                    </p>
                    Source: <a href="https://el.wikipedia.org/wiki/%CE%9D%CF%84%CE%AD%CE%BD%CE%B9%CF%82_%CE%A1%CE%AF%CF%84%CF%83%CE%B9" target="_blank" rel="noopener">Wikipedia</a>
                </article>
            </div>
        </aside>
        <footer>
            <a href="aboutus.php">About Us</a>
            &copy;2021 All rights reserved
        </footer>
    </div>
    
</body>
</html>